In [3]:
import pandas as pd
import numpy as np
import timeit

26. How to get the mean of a series grouped by another series?
Difficiulty Level: L2

Compute the mean of weights of each fruit.

Input
```python
fruit = pd.Series(np.random.choice(['apple', 'banana', 'carrot'], 10))
weights = pd.Series(np.linspace(1, 10, 10))
print(weight.tolist())
print(fruit.tolist())
#> [1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0, 9.0, 10.0]
#> ['banana', 'carrot', 'apple', 'carrot', 'carrot', 'apple', 'banana', 'carrot', 'apple', 'carrot']
```

Desired output
```python
# values can change due to randomness
apple     6.0
banana    4.0
carrot    5.8
dtype: float64
```

In [4]:
fruit = pd.Series(np.random.choice(['apple', 'banana', 'carrot'], 10))
weights = pd.Series(np.linspace(1, 10, 10))
print(weights.tolist())
print(fruit.tolist())

[1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0, 9.0, 10.0]
['banana', 'apple', 'carrot', 'carrot', 'carrot', 'banana', 'carrot', 'apple', 'banana', 'banana']

In [20]:
#solution1:
df = pd.concat([fruit, weights], axis=1)
df.columns = ['fruit', 'weights']
df.groupby('fruit').mean()

        weights
fruit
apple      5.00
banana     6.50
carrot     4.75

In [22]:
#solution2
weights.groupby(fruit).mean()

apple     5.00
banana    6.50
carrot    4.75
dtype: float64

27. How to compute the euclidean distance between two series?
Difficiulty Level: L2

Compute the euclidean distance between series (points) p and q, without using a packaged formula.

Input
```python
p = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
q = pd.Series([10, 9, 8, 7, 6, 5, 4, 3, 2, 1])
```
Desired Output
18.165

In [25]:
#solution
p = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
q = pd.Series([10, 9, 8, 7, 6, 5, 4, 3, 2, 1])
np.sqrt(np.sum([(x-y)*(x-y) for x, y in zip(p, q)]))

18.16590212458495

28. How to find all the local maxima (or peaks) in a numeric series?
Difficiulty Level: L3

Get the positions of peaks (values surrounded by smaller values on both sides) in ser.

Input
```python
ser = pd.Series([2, 10, 3, 4, 9, 10, 2, 7, 3])
```
Desired output
array([1, 5, 7])

In [41]:
%%time
ser = pd.Series([2, 10, 3, 4, 9, 10, 2, 7, 3])
#mysolution
import time
peak = [
    i + 1
    for i in range(len(ser)-2)
    if np.argmax([ser[i], ser[i + 1], ser[i + 2]]) == 1
]
peak

CPU times: user 217 µs, sys: 69 µs, total: 286 µs
Wall time: 260 µs

[1, 5, 7]

In [56]:
%%time
ser = pd.Series([2, 10, 3, 4, 9, 10, 2, 7, 3])
#solution
dd = np.diff(np.sign(np.diff(ser)))
np.where(dd==-2)[0] + 1

CPU times: user 528 µs, sys: 1e+03 ns, total: 529 µs
Wall time: 543 µs

array([1, 5, 7])

29. How to replace missing spaces in a string with the least frequent character?
Replace the spaces in my_str with the least frequent character.

Difficiulty Level: L2

Input
```python
my_str = 'dbc deb abed ggade'
```

Desired Output
```python
'dbccdebcabedcggade'  # least frequent is 'c'
```

In [87]:
#mysolution
from collections import Counter
my_str = 'dbc deb abed ggade'
counter = Counter(my_str)
least_freq_char = min(counter, key=counter.get)
my_str.replace(" ", least_freq_char)

'dbccdebcabedcggade'

In [86]:
#solution
my_str = 'dbc deb abed ggade'
ser = pd.Series(list('dbc deb abed ggade'))
freq = ser.value_counts()
least_freq = freq.dropna().index[-1]
my_str.replace(' ', least_freq)

'dbccdebcabedcggade'

30. How to create a TimeSeries starting ‘2000-01-01’ and 10 weekends (saturdays) after that having random numbers as values?
Difficiulty Level: L2

Desired output
```
# values can be random
2000-01-01    4
2000-01-08    1
2000-01-15    8
2000-01-22    4
2000-01-29    4
2000-02-05    2
2000-02-12    4
2000-02-19    9
2000-02-26    6
2000-03-04    6
```

In [104]:
#mysolution
dates = pd.date_range('2000-01-01', periods=10, freq="W-SAT")
values = np.random.randint(0,10,size=10)
df = pd.Series(values, index=dates)
print(df)

2000-01-01    7
2000-01-08    0
2000-01-15    8
2000-01-22    1
2000-01-29    5
2000-02-05    3
2000-02-12    8
2000-02-19    7
2000-02-26    8
2000-03-04    4
Freq: W-SAT, dtype: int64

In [106]:
# Solution
ser = pd.Series(np.random.randint(1,10,10), pd.date_range('2000-01-01', periods=10, freq='W-SAT'))
ser

2000-01-01    8
2000-01-08    5
2000-01-15    4
2000-01-22    6
2000-01-29    6
2000-02-05    5
2000-02-12    1
2000-02-19    8
2000-02-26    2
2000-03-04    1
Freq: W-SAT, dtype: int64

31. How to fill an intermittent time series so all missing dates show up with values of previous non-missing date?
Difficiulty Level: L2

ser has missing dates and values. Make all missing dates appear and fill up with value from previous date.

Input
```python
ser = pd.Series([1,10,3,np.nan], index=pd.to_datetime(['2000-01-01', '2000-01-03', '2000-01-06', '2000-01-08']))
print(ser)
#> 2000-01-01     1.0
#> 2000-01-03    10.0
#> 2000-01-06     3.0
#> 2000-01-08     NaN
#> dtype: float64
Desired Output

2000-01-01     1.0
2000-01-02     1.0
2000-01-03    10.0
2000-01-04    10.0
2000-01-05    10.0
2000-01-06     3.0
2000-01-07     3.0
2000-01-08     NaN
```

In [ ]:
#mysolution
dates = pd.date_range('2000-01-01', periods=10, freq="W-SAT")
values = np.random.randint(0,10,size=10)
df = pd.Series(values, index=dates)
print(df)

2000-01-01    7
2000-01-08    0
2000-01-15    8
2000-01-22    1
2000-01-29    5
2000-02-05    3
2000-02-12    8
2000-02-19    7
2000-02-26    8
2000-03-04    4
Freq: W-SAT, dtype: int64

In [ ]:
#mysolution
dates = pd.date_range('2000-01-01', periods=10, freq="W-SAT")
values = np.random.randint(0,10,size=10)
df = pd.Series(values, index=dates)
print(df)

2000-01-01    7
2000-01-08    0
2000-01-15    8
2000-01-22    1
2000-01-29    5
2000-02-05    3
2000-02-12    8
2000-02-19    7
2000-02-26    8
2000-03-04    4
Freq: W-SAT, dtype: int64

In [ ]:
#mysolution
dates = pd.date_range('2000-01-01', periods=10, freq="W-SAT")
values = np.random.randint(0,10,size=10)
df = pd.Series(values, index=dates)
print(df)

2000-01-01    7
2000-01-08    0
2000-01-15    8
2000-01-22    1
2000-01-29    5
2000-02-05    3
2000-02-12    8
2000-02-19    7
2000-02-26    8
2000-03-04    4
Freq: W-SAT, dtype: int64

In [ ]:
#mysolution
dates = pd.date_range('2000-01-01', periods=10, freq="W-SAT")
values = np.random.randint(0,10,size=10)
df = pd.Series(values, index=dates)
print(df)

2000-01-01    7
2000-01-08    0
2000-01-15    8
2000-01-22    1
2000-01-29    5
2000-02-05    3
2000-02-12    8
2000-02-19    7
2000-02-26    8
2000-03-04    4
Freq: W-SAT, dtype: int64

In [ ]:
#mysolution
dates = pd.date_range('2000-01-01', periods=10, freq="W-SAT")
values = np.random.randint(0,10,size=10)
df = pd.Series(values, index=dates)
print(df)

2000-01-01    7
2000-01-08    0
2000-01-15    8
2000-01-22    1
2000-01-29    5
2000-02-05    3
2000-02-12    8
2000-02-19    7
2000-02-26    8
2000-03-04    4
Freq: W-SAT, dtype: int64

In [ ]:
#mysolution
dates = pd.date_range('2000-01-01', periods=10, freq="W-SAT")
values = np.random.randint(0,10,size=10)
df = pd.Series(values, index=dates)
print(df)

2000-01-01    7
2000-01-08    0
2000-01-15    8
2000-01-22    1
2000-01-29    5
2000-02-05    3
2000-02-12    8
2000-02-19    7
2000-02-26    8
2000-03-04    4
Freq: W-SAT, dtype: int64

In [113]:
# Create the time series with missing dates and values
ser = pd.Series([1,10,3,np.nan], index=pd.to_datetime(['2000-01-01', '2000-01-03', '2000-01-06', '2000-01-08']))

# Use the resample() function to resample the time series to a daily frequency
# and fill the missing values with the value from the previous date using the ffill() function
filled_ser = ser.resample('D').ffill()

# Print the filled time series
print(filled_ser)

2000-01-01     1.0
2000-01-02     1.0
2000-01-03    10.0
2000-01-04    10.0
2000-01-05    10.0
2000-01-06     3.0
2000-01-07     3.0
2000-01-08     NaN
Freq: D, dtype: float64

32. How to compute the autocorrelations of a numeric series?
Difficiulty Level: L3

Compute autocorrelations for the first 10 lags of ser. Find out which lag has the largest correlation.

Input
```python
ser = pd.Series(np.arange(20) + np.random.normal(1, 10, 20))
Desired output

# values will change due to randomness
[0.29999999999999999, -0.11, -0.17000000000000001, 0.46000000000000002, 0.28000000000000003, -0.040000000000000001, -0.37, 0.41999999999999998, 0.47999999999999998, 0.17999999999999999]
Lag having highest correlation:  9
```

In [114]:
ser = pd.Series(np.arange(20) + np.random.normal(1, 10, 20))

In [134]:
#mysolution
autocorr_lags = [[idx, ser.autocorr(lag=i)] for idx, i in enumerate(range(1, 10+1), start=1)]
df = pd.DataFrame(autocorr_lags, columns=['lag', 'Autocorrelation']).set_index('lag')
print(df)
print(f'Lag having highest correlation: {np.argmax(np.abs(df)) + 1}')

     Autocorrelation
lag
1           0.357105
2           0.226136
3          -0.052656
4          -0.075345
5           0.078169
6          -0.123514
7           0.530451
8           0.150687
9           0.117693
10         -0.120833
Lag having highest correlation: 7

In [136]:
ser = pd.Series(np.arange(20) + np.random.normal(1, 10, 20))

# Solution
autocorrelations = [ser.autocorr(i) for i in range(11)]
print(autocorrelations[1:])
print('Lag having highest correlation: ', np.argmax(np.abs(autocorrelations[1:]))+1)

[0.22961196123644328, 0.318042797301141, 0.3982910814695383, 0.5325798943169696, 0.6455223805508616, -0.20474426599962073, 0.44607266802332274, 0.2906466220926534, 0.6459539923208838, -0.407709228799326]
Lag having highest correlation:  9

33. How to import only every nth row from a csv file to create a dataframe?
Difficiulty Level: L2

Import every 50th row of BostonHousing dataset as a dataframe.

In [146]:
#mysolution
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/BostonHousing.csv')
print(f'original shape is: {df.shape}')
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/BostonHousing.csv', skiprows=lambda x: x % 50)
print(f'The new dataframe shape is: {df.shape}')
df.head()

original shape is: (506, 14)
The new dataframe shape is: (10, 14)

,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,b,lstat,medv
0,0.21977,0,6.91,0,0.448,5.602,62.0,6.0877,3,233,17.9,396.90,16.20,19.4
1,0.06860,0,2.89,0,0.445,7.416,62.5,3.4952,2,276,18.0,396.90,6.19,33.2
2,2.73397,0,19.58,0,0.871,5.597,94.9,1.5257,5,403,14.7,351.85,21.45,15.4
3,0.03150,95,1.47,0,0.403,6.975,15.3,7.6534,3,402,17.0,396.90,4.56,34.9
4,0.19073,22,5.86,0,0.431,6.718,17.5,7.8265,7,330,19.1,393.74,6.56,26.2

In [ ]:
# Solution 1: Use chunks and for-loop
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/BostonHousing.csv', chunksize=50)
df2 = pd.DataFrame()
for chunk in df:
    df2 = df2.append(chunk.iloc[0,:])


# Solution 2: Use chunks and list comprehension
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/BostonHousing.csv', chunksize=50)
df2 = pd.concat([chunk.iloc[0] for chunk in df], axis=1)
df2 = df2.transpose()

# Solution 3: Use csv reader
import csv          
with open('BostonHousing.csv', 'r') as f:
    reader = csv.reader(f)
    out = []
    for i, row in enumerate(reader):
        if i%50 == 0:
            out.append(row)

df2 = pd.DataFrame(out[1:], columns=out[0])
print(df2.head())

34. How to change column values when importing csv to a dataframe?
Difficulty Level: L2

Import the boston housing dataset, but while importing change the 'medv' (median house value) column so that values < 25 becomes ‘Low’ and > 25 becomes ‘High’.

In [148]:
#mysolution
df = pd.read_csv(filepath_or_buffer='https://raw.githubusercontent.com/selva86/datasets/master/BostonHousing.csv', 
                 converters={'medv': lambda x: 'Low' if float(x) < 25 else 'High'})
df.head()

,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,b,lstat,medv
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296,15.3,396.90,4.98,Low
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242,17.8,396.90,9.14,Low
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242,17.8,392.83,4.03,High
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222,18.7,394.63,2.94,High
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222,18.7,396.90,5.33,High

In [ ]:
# Solution 1: Using converter parameter
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/BostonHousing.csv', 
                 converters={'medv': lambda x: 'High' if float(x) > 25 else 'Low'})


# Solution 2: Using csv reader
import csv
with open('BostonHousing.csv', 'r') as f:
    reader = csv.reader(f)
    out = []
    for i, row in enumerate(reader):
        if i > 0:
            row[13] = 'High' if float(row[13]) > 25 else 'Low'
        out.append(row)

df = pd.DataFrame(out[1:], columns=out[0])
print(df.head())

37. How to get the nrows, ncolumns, datatype, summary stats of each column of a dataframe? Also get the array and list equivalent.
Difficulty Level: L2

Get the number of rows, columns, datatype and summary statistics of each column of the Cars93 dataset. Also get the numpy array and list equivalent of the dataframe.

In [158]:
#solution
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')
#  number of rows and columns
print(df.shape)

# datatypes
print(df.dtypes)

# how many columns under each dtype
print(df.dtypes.value_counts())

# summary statistics
df_stats = df.describe()

# numpy array 
df_arr = df.values

# list
df_list = df.values.tolist()

(93, 27)
Manufacturer           object
Model                  object
Type                   object
Min.Price             float64
Price                 float64
Max.Price             float64
MPG.city              float64
MPG.highway           float64
AirBags                object
DriveTrain             object
Cylinders              object
EngineSize            float64
Horsepower            float64
RPM                   float64
Rev.per.mile          float64
Man.trans.avail        object
Fuel.tank.capacity    float64
Passengers            float64
Length                float64
Wheelbase             float64
Width                 float64
Turn.circle           float64
Rear.seat.room        float64
Luggage.room          float64
Weight                float64
Origin                 object
Make                   object
dtype: object
float64    18
object      9
dtype: int64

38. How to extract the row and column number of a particular cell with given criterion?
Difficulty Level: L1

Input
```python
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')
```
Which manufacturer, model and type has the highest Price? What is the row and column number of the cell with the highest Price value?

In [159]:
#mysolution
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')
df.head()

,Manufacturer,Model,Type,Min.Price,Price,Max.Price,MPG.city,MPG.highway,AirBags,DriveTrain,...,Passengers,Length,Wheelbase,Width,Turn.circle,Rear.seat.room,Luggage.room,Weight,Origin,Make
0,Acura,Integra,Small,12.9,15.9,18.8,25.0,31.0,None,Front,...,5.0,177.0,102.0,68.0,37.0,26.5,NaN,2705.0,non-USA,Acura Integra
1,NaN,Legend,Midsize,29.2,33.9,38.7,18.0,25.0,Driver & Passenger,Front,...,5.0,195.0,115.0,71.0,38.0,30.0,15.0,3560.0,non-USA,Acura Legend
2,Audi,90,Compact,25.9,29.1,32.3,20.0,26.0,Driver only,Front,...,5.0,180.0,102.0,67.0,37.0,28.0,14.0,3375.0,non-USA,Audi 90
3,Audi,100,Midsize,NaN,37.7,44.6,19.0,26.0,Driver & Passenger,NaN,...,6.0,193.0,106.0,NaN,37.0,31.0,17.0,3405.0,non-USA,Audi 100
4,BMW,535i,Midsize,NaN,30.0,NaN,22.0,30.0,NaN,Rear,...,4.0,186.0,109.0,69.0,39.0,27.0,13.0,3640.0,non-USA,BMW 535i

In [162]:
df[['Manufacturer', 'Price']].groupby('Manufacturer').max()

               Price
Manufacturer
Acura           15.9
Audi            37.7
BMW             30.0
Buick           26.3
Cadillac        40.1
Chevrolet       38.0
Chrysler        29.5
Dodge           25.8
Eagle           19.3
Ford            20.9
Geo             12.5
Honda           19.8
Hyundai         13.9
Infiniti        47.9
Lexus           28.0
Lincoln         36.1
Mazda           32.5
Mercedes-Benz   61.9
Mercury         14.9
Mitsubishi      26.1
Nissan          21.5
Oldsmobile      20.7
Plymouth        14.4
Pontiac         24.4
Saab            28.7
Saturn           NaN
Subaru          19.5
Suzuki           8.6
Toyota          22.7
Volkswagen      23.3
Volvo           22.7

In [174]:
#mysolution

# Find the row with the highest price
row = df['Price'].idxmax()
print(df.loc[row, ['Manufacturer', 'Model', 'Type']])

# Get the row and column number
row, col = np.where(df==np.max(df.Price))
print(f"The highest price is at row {row} and column {col}.")

df['Price'].max()

Manufacturer    Mercedes-Benz
Model                    300E
Type                  Midsize
Name: 58, dtype: object
The highest price is at row [58] and column [4].

61.9

In [ ]:
Solution
# Get Manufacturer with highest price
df.loc[df.Price == np.max(df.Price), ['Manufacturer', 'Model', 'Type']]

# Get Row and Column number
row, col = np.where(df.values == np.max(df.Price))

# Get the value
df.iat[row[0], col[0]]
df.iloc[row[0], col[0]]

# Alternates
df.at[row[0], 'Price']
df.get_value(row[0], 'Price')

# The difference between `iat` - `iloc` vs `at` - `loc` is:
# `iat` snd `iloc` accepts row and column numbers. 
# Whereas `at` and `loc` accepts index and column names.

39. How to rename a specific columns in a dataframe?
Difficulty Level: L2

Rename the column Type as CarType in df and replace the ‘.’ in column names with ‘_’.

Input
```python
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')
print(df.columns)
#> Index(['Manufacturer', 'Model', 'Type', 'Min.Price', 'Price', 'Max.Price',
#>        'MPG.city', 'MPG.highway', 'AirBags', 'DriveTrain', 'Cylinders',
#>        'EngineSize', 'Horsepower', 'RPM', 'Rev.per.mile', 'Man.trans.avail',
#>        'Fuel.tank.capacity', 'Passengers', 'Length', 'Wheelbase', 'Width',
#>        'Turn.circle', 'Rear.seat.room', 'Luggage.room', 'Weight', 'Origin',
#>        'Make'],
#>       dtype='object')
Desired Solution

print(df.columns)
#> Index(['Manufacturer', 'Model', 'CarType', 'Min_Price', 'Price', 'Max_Price',
#>        'MPG_city', 'MPG_highway', 'AirBags', 'DriveTrain', 'Cylinders',
#>        'EngineSize', 'Horsepower', 'RPM', 'Rev_per_mile', 'Man_trans_avail',
#>        'Fuel_tank_capacity', 'Passengers', 'Length', 'Wheelbase', 'Width',
#>        'Turn_circle', 'Rear_seat_room', 'Luggage_room', 'Weight', 'Origin',
#>        'Make'],
#>       dtype='object')
```

In [181]:
#mysolution
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')
print(df.columns)
df.rename(columns={'Type': "CarType"},)
df.columns = df.columns.str.replace('.', '_')
df.columns

Index(['Manufacturer', 'Model', 'Type', 'Min.Price', 'Price', 'Max.Price',
       'MPG.city', 'MPG.highway', 'AirBags', 'DriveTrain', 'Cylinders',
       'EngineSize', 'Horsepower', 'RPM', 'Rev.per.mile', 'Man.trans.avail',
       'Fuel.tank.capacity', 'Passengers', 'Length', 'Wheelbase', 'Width',
       'Turn.circle', 'Rear.seat.room', 'Luggage.room', 'Weight', 'Origin',
       'Make'],
      dtype='object')

/var/folders/h9/_cnsh0kx7l9fthj4zzpl2d5h0000gn/T/ipykernel_79282/1163144395.py:4: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df.columns = df.columns.str.replace('.', '_')

Index(['Manufacturer', 'Model', 'Type', 'Min_Price', 'Price', 'Max_Price',
       'MPG_city', 'MPG_highway', 'AirBags', 'DriveTrain', 'Cylinders',
       'EngineSize', 'Horsepower', 'RPM', 'Rev_per_mile', 'Man_trans_avail',
       'Fuel_tank_capacity', 'Passengers', 'Length', 'Wheelbase', 'Width',
       'Turn_circle', 'Rear_seat_room', 'Luggage_room', 'Weight', 'Origin',
       'Make'],
      dtype='object')

In [182]:
# Input
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

# Solution
# Step 1:
df=df.rename(columns = {'Type':'CarType'})
# or
df.columns.values[2] = "CarType"

# Step 2:
df.columns = df.columns.map(lambda x: x.replace('.', '_'))
print(df.columns)

Index(['Manufacturer', 'Model', 'CarType', 'Min_Price', 'Price', 'Max_Price',
       'MPG_city', 'MPG_highway', 'AirBags', 'DriveTrain', 'Cylinders',
       'EngineSize', 'Horsepower', 'RPM', 'Rev_per_mile', 'Man_trans_avail',
       'Fuel_tank_capacity', 'Passengers', 'Length', 'Wheelbase', 'Width',
       'Turn_circle', 'Rear_seat_room', 'Luggage_room', 'Weight', 'Origin',
       'Make'],
      dtype='object')

40. How to check if a dataframe has any missing values?
Difficulty Level: L1

Check if df has any missing values.

Input

df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

In [190]:
#mysolution
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')
df.isnull().values.any()

True

41. How to count the number of missing values in each column?
Difficulty Level: L2

Count the number of missing values in each column of df. Which column has the maximum number of missing values?

Input

df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

In [4]:
# Input
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

# Solution
n_missings_each_col = df.apply(lambda x: x.isnull().sum())
n_missings_each_col.idxmax()

'Luggage.room'

42. How to replace missing values of multiple numeric columns with the mean?
Difficulty Level: L2

Replace missing values in Min.Price and Max.Price columns with their respective mean.

Input

df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

In [5]:
#mysolution

df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

df_price = df[['Min.Price', 'Max.Price']] = df[['Min.Price', 'Max.Price']].apply(lambda x: x.fillna(x.mean()))
print(df_price.head())

   Min.Price  Max.Price
0  12.900000  18.800000
1  29.200000  38.700000
2  25.900000  32.300000
3  17.118605  44.600000
4  17.118605  21.459091

43. How to use apply function on existing columns with global variables as additional arguments?
Difficulty Level: L3

In df, use apply method to replace the missing values in Min.Price with the column’s mean and those in Max.Price with the column’s median.

Input

df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

In [7]:
#mysolution

import pandas as pd

# Read in the data
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

# Calculate the mean and median of the Min.Price and Max.Price columns
min_mean = df['Min.Price'].mean()
max_median = df['Max.Price'].median()

# Define a lambda function that takes in three arguments: a value, a mean, and a median
fill_missing_values = lambda x, mean, median: x.fillna(mean) if x.name == 'Min.Price' else x.fillna(median)

# Use the apply function to replace missing values in the Min.Price and Max.Price columns
df_price = df[['Min.Price', 'Max.Price']] = df[['Min.Price', 'Max.Price']].apply(fill_missing_values, mean=min_mean, median=max_median)
df_price.head()

   Min.Price  Max.Price
0  12.900000      18.80
1  29.200000      38.70
2  25.900000      32.30
3  17.118605      44.60
4  17.118605      19.15

In [ ]:
# Input
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

# Solution
d = {'Min.Price': np.nanmean, 'Max.Price': np.nanmedian}
df[['Min.Price', 'Max.Price']] = df[['Min.Price', 'Max.Price']].apply(lambda x, d: x.fillna(d[x.name](x)), args=(d, ))

44. How to select a specific column from a dataframe as a dataframe instead of a series?
Difficulty Level: L2

Get the first column (a) in df as a dataframe (rather than as a Series).

Input

df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))

In [16]:
#mysolution
df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))
# return a dataframe
print(type(df[['a']]))
print(type(df.loc[:, ['a']]))
print(type(df.iloc[:, [0]]))
print('\n')
# return a Series
print(type(df.a))
print(type(df['a']))
print(type(df.loc[:, 'a']))
print(type(df.iloc[:, 1]))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>


<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

45. How to change the order of columns of a dataframe?
Difficulty Level: L3

Actually 3 questions.

1. In df, interchange columns 'a' and 'c'.
2. Create a generic function to interchange two columns, without hardcoding column names.
3. Sort the columns in reverse alphabetical order, that is colume 'e' first through column 'a' last.

Input

df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))

In [17]:
df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))

In [18]:
# Q1
df.head()

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [20]:
df = df.iloc[:, [2,1,0,3,4]]
df.head()

    c   b   a   d   e
0   2   1   0   3   4
1   7   6   5   8   9
2  12  11  10  13  14
3  17  16  15  18  19

In [23]:
# Q3
df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))
df.sort_index(axis=1, ascending=False, inplace=True)
df.head()

    e   d   c   b   a
0   4   3   2   1   0
1   9   8   7   6   5
2  14  13  12  11  10
3  19  18  17  16  15

In [26]:
# Q3
df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))
df = df[sorted(df.columns, reverse=True)]
df.head()

    e   d   c   b   a
0   4   3   2   1   0
1   9   8   7   6   5
2  14  13  12  11  10
3  19  18  17  16  15

In [ ]:
# Input
df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))

# Solution Q1
df[list('cbade')]

# Solution Q2 - No hard coding
def switch_columns(df, col1=None, col2=None):
    colnames = df.columns.tolist()
    i1, i2 = colnames.index(col1), colnames.index(col2)
    colnames[i2], colnames[i1] = colnames[i1], colnames[i2]
    return df[colnames]

df1 = switch_columns(df, 'a', 'c')

# Solution Q3
df[sorted(df.columns)]
# or
df.sort_index(axis=1, ascending=False, inplace=True)

46. How to set the number of rows and columns displayed in the output?
Difficulty Level: L2

Change the pamdas display settings on printing the dataframe df it shows a maximum of 10 rows and 10 columns.

In [27]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

In [29]:
#mysolution
pd.set_option('display.max_columns', 10)
pd.set_option('display.max_rows', 10)
df

,Manufacturer,Model,Type,Min.Price,Price,...,Rear.seat.room,Luggage.room,Weight,Origin,Make
0,Acura,Integra,Small,12.9,15.9,...,26.5,NaN,2705.0,non-USA,Acura Integra
1,NaN,Legend,Midsize,29.2,33.9,...,30.0,15.0,3560.0,non-USA,Acura Legend
2,Audi,90,Compact,25.9,29.1,...,28.0,14.0,3375.0,non-USA,Audi 90
3,Audi,100,Midsize,NaN,37.7,...,31.0,17.0,3405.0,non-USA,Audi 100
4,BMW,535i,Midsize,NaN,30.0,...,27.0,13.0,3640.0,non-USA,BMW 535i
...,...,...,...,...,...,...,...,...,...,...,...
88,Volkswagen,Eurovan,Van,16.6,19.7,...,34.0,NaN,3960.0,NaN,Volkswagen Eurovan
89,Volkswagen,Passat,Compact,17.6,20.0,...,31.5,14.0,2985.0,non-USA,Volkswagen Passat
90,Volkswagen,Corrado,Sporty,22.9,23.3,...,26.0,15.0,2810.0,non-USA,Volkswagen Corrado
91,Volvo,240,Compact,21.8,22.7,...,29.5,14.0,2985.0,non-USA,Volvo 240
92,NaN,850,Midsize,24.8,26.7,...,30.0,15.0,3245.0,non-USA,Volvo 850

47. How to format or suppress scientific notations in a pandas dataframe?
Difficulty Level: L2

Suppress scientific notations like ‘e-03’ in df and print upto 4 numbers after decimal.

Input
```
df = pd.DataFrame(np.random.random(4)**10, columns=['random'])
df
#>          random
#> 0  3.474280e-03
#> 1  3.951517e-05
#> 2  7.469702e-02
#> 3  5.541282e-28
Desired Output

#>    random
#> 0  0.0035
#> 1  0.0000
#> 2  0.0747
#> 3  0.0000
```

In [30]:
df = pd.DataFrame(np.random.random(4)**10, columns=['random'])

In [31]:
df

         random
0  1.243622e-13
1  7.664959e-06
2  3.404218e-02
3  3.144772e-01

In [35]:
#mysolytion

# Set the float format to display 2 decimal places
pd.options.display.float_format = '{:,.4f}'.format

# Print the DataFrame
print(df)

   random
0  0.0000
1  0.0000
2  0.0340
3  0.3145

In [34]:
# Input
df = pd.DataFrame(np.random.random(4)**10, columns=['random'])

# Solution 1: Rounding
df.round(4)

# Solution 2: Use apply to change format
df.apply(lambda x: '%.4f' % x, axis=1)
# or
df.applymap(lambda x: '%.4f' % x)

# Solution 3: Use set_option
pd.set_option('display.float_format', lambda x: '%.4f' % x)

# Solution 4: Assign display.float_format
pd.options.display.float_format = '{:.4f}'.format
print(df)

# Reset/undo float formatting
pd.options.display.float_format = None

48. How to format all the values in a dataframe as percentages?
Difficulty Level: L2

Format the values in column 'random' of df as percentages.

Input
```
df = pd.DataFrame(np.random.random(4), columns=['random'])
df
#>      random
#> 0    .689723
#> 1    .957224
#> 2    .159157
#> 3    .21082
Desired Output

#>      random
#> 0    68.97%
#> 1    95.72%
#> 2    15.91%
#> 3    2.10%
```

In [52]:
df = pd.DataFrame(np.random.random(4), columns=['random'])
df

   random
0  0.2404
1  0.9545
2  0.6982
3  0.0281

In [53]:
df.loc[:, 'random'] = df['random'].map('{:.2%}'.format)
df

   random
0  24.04%
1  95.45%
2  69.82%
3   2.81%

49. How to filter every nth row in a dataframe?
Difficulty Level: L1

From df, filter the 'Manufacturer', 'Model' and 'Type' for every 20th row starting from 1st (row 0).

In [65]:
#mysolution
df_new = df[['Manufacturer', 'Model', 'Type']].apply(lambda x: x[::20])
df_new.shape
df_new

   Manufacturer    Model     Type
0         Acura  Integra    Small
20     Chrysler  LeBaron  Compact
40        Honda  Prelude   Sporty
60      Mercury   Cougar  Midsize
80       Subaru   Loyale    Small

In [64]:
#solution
df.iloc[::20, :][['Manufacturer', 'Model', 'Type']]

   Manufacturer    Model     Type
0         Acura  Integra    Small
20     Chrysler  LeBaron  Compact
40        Honda  Prelude   Sporty
60      Mercury   Cougar  Midsize
80       Subaru   Loyale    Small

50. How to create a primary key index by combining relevant columns?
Difficulty Level: L2

In df, Replace NaNs with ‘missing’ in columns 'Manufacturer', 'Model' and 'Type' and create a index as a combination of these three columns and check if the index is a primary key.

Input
```python
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv', usecols=[0,1,2,3,5])
Desired Output

                       Manufacturer    Model     Type  Min.Price  Max.Price
Acura_Integra_Small           Acura  Integra    Small       12.9       18.8
missing_Legend_Midsize      missing   Legend  Midsize       29.2       38.7
Audi_90_Compact                Audi       90  Compact       25.9       32.3
Audi_100_Midsize               Audi      100  Midsize        NaN       44.6
BMW_535i_Midsize                BMW     535i  Midsize        NaN        NaN
```

In [66]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv', usecols=[0,1,2,3,5])

In [67]:
df.head()

  Manufacturer    Model     Type  Min.Price  Max.Price
0        Acura  Integra    Small    12.9000    18.8000
1          NaN   Legend  Midsize    29.2000    38.7000
2         Audi       90  Compact    25.9000    32.3000
3         Audi      100  Midsize        NaN    44.6000
4          BMW     535i  Midsize        NaN        NaN

In [74]:
#mysolution
df[['Manufacturer', 'Model', 'Type']] = df[['Manufacturer', 'Model', 'Type']].fillna('missing')

# Combine 'Manufacturer', 'Model', and 'Type' into a single index column
df['index'] = df[['Manufacturer', 'Model', 'Type']].apply(lambda x: '_'.join(x), axis=1)

# Set 'index' as the DataFrame index
df.set_index('index', inplace=True)
pd.set_option('display.float_format', lambda x: '%.1f' % x)

In [75]:
df.head()

                       Manufacturer    Model     Type  Min.Price  Max.Price
index
Acura_Integra_Small           Acura  Integra    Small       12.9       18.8
missing_Legend_Midsize      missing   Legend  Midsize       29.2       38.7
Audi_90_Compact                Audi       90  Compact       25.9       32.3
Audi_100_Midsize               Audi      100  Midsize        NaN       44.6
BMW_535i_Midsize                BMW     535i  Midsize        NaN        NaN